Tekla Open API Reference for Tekla Structures 2025
RebarComplexGeometry Class
 The ReinforcingBar class represents a single physical reinforcing bar. It contains the curves and bendings that define the geometry of the bar.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.RebarComplexGeometry
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class RebarComplexGeometry
<SerializableAttribute>
Public NotInheritable Class RebarComplexGeometry
The RebarComplexGeometry type exposes the following members.
Properties
Name | Description
BendingRadiuses
 The bending radiuses of the wire.
Diameter
 Gets the diameter of the wire.
Legs
 Gets the list of RebarLegs of the bar.
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
using System.Collections;
public class Example
{
    public void Example1()
    {
        var rebarGroup = new RebarGroup();
        var barGeometries = rebarGroup.GetRebarComplexGeometries(true, true, true);
        foreach (RebarComplexGeometry barGeom in barGeometries)
        {
            Console.WriteLine("Bar has the following curves:");
            foreach (var leg in barGeom.Legs)
            {
                if (leg.Curve is LineSegment)
                {
                    Console.Write("Line ");
                }
                else if (leg.Curve is Arc)
                {
                    Console.Write("Arc ");
                }
            }
            Console.WriteLine();
        }
    }
}
See Also
Reference
Tekla.Structures.Model Namespace